Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition
Describes how the text will be positioned with respect to dimension line.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition.OutsideOfDimensionLine
The text will be positioned on the outside of the dimension line, where inside is represented by the bar curves.

Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition.Default
The text will be positioned according to the default behavior.